#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    double a; // Оголошуємо задану змінну
    cout << "Зауважте, що число має відповідати умові - знаходиться в проміжку 0<a<=2! \n a = ";
    cin >> a;
    double num, diff, sum = 0; // Оголошуємо допоміжні змінні (num - k-й член ряду, diff - модуль різниці)
    int k = 1; // Оголошуємо допоміжну змінну
    
    if (a > 0 && a <= 2) {
        do
        {
            num = pow(-1, k + 1) * pow(a - 1, k) / k; // Робимо розрахунки відповідно до умови
            sum += num; // Пораховане число додаємо до суми
            diff = abs(sum - log(a)); // Обчислюємо модуль різниці між сумою ряду та значенням функції Ln(a), отриманим за допомогою стандартної функції
            cout << diff << endl;
            k++; // Інкрементація ітератора
        } while (diff > pow(10, (-6))); // Ітераційний цикл, що триває до набуття заданої точності епсілон
    }
    else
        return 0; // Повертаємо нуль, бо змінна a не підходить за умовою задачі
    
    cout << "Значення отримано за допомогою ряду: " << sum << endl;
    cout << "Значення отримано за допомогою стандартної функції: " << log(a) << endl;
}
