//Коло вписане в квадрат із заданою площею. Знайти площу квадрата, вписаного у це коло. Визначити у скільки разів площа вписаного квадрата менша за площу заданого квадрата.

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    double areaL, sideL; //оголошуємо змінні для квадрата описаного навколо кола(більшого)
    double areaS, sideS; //оголошуємо змінні для квадрата вписаного в коло(меншого)
    double result; //оголошуємо змінну для визначення результата

    cout << "Введіть площу квадрата описаного навколо кола: ";
    cin >> areaL;
    sideL = sqrt(areaL);
    cout << "Сторона більшого квадрата = " << sideL << "\n";

    sideS = sideL / sqrt(2);
    cout << "Сторона меншого квадрата = " << sideS << "\n";
    areaS = pow(sideS, 2);
    cout << "Площа вписаного квадрата = " << areaS << "\n";

    result = areaL / areaS;
    cout << "Результат = " << result << "\n";
    
    return 0;
}
